Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
     # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "127214202110:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
      - owner              = "127214202110" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250529_034638_00009_yhm9j" -> null
          - "presto_version"     = "0.215-23240-g0b85517" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "individualid",
              - "biosampleid",
              - "runid",
              - "analysisid",
            ]
          ~ location                  = "s3://gasi-metadata-20250524134912137300000004/relations/" -> "s3://gasi-metadata-20250524134912137300000004/relations"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "127214202110:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
      - owner              = "127214202110" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250529_034630_00201_6am4h" -> null
          - "presto_version"     = "0.215-23240-g0b85517" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250524134912137300000004/runs/" -> "s3://gasi-metadata-20250524134912137300000004/runs"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ code_sha256                 = "IZTaK6YFTflZ+/Rpc3tR7AZOBr5ORSpQI02ATqrYuHs=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-27T02:18:05.408+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "A5B+lUOa+ki4fQ9Nd6pu9rQK0Sdf47pABup6zGRO5oJ0McdRMhSSnos+Q8d8qzl9R4EuARRhhnfpFG/7yhSVhQ==" -> "J7Lsv450UCmNfnnnoEHv7kWDvXc3dM9RosyXbzjmo2Xc+aj9JRv+c/8VlUVGXHw1XHMBv4s7xUTKzUUs/GB1Xw==" # forces replacement
      ~ source_code_size            = 18422771 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
        id                                     = "gasi-dataportal-20250524134911180600000001"
        # (3 unchanged attributes hidden)

      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "staging/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_versioning.dataportal-bucket will be created
  + resource "aws_s3_bucket_versioning" "dataportal-bucket" {
      + bucket = "gasi-dataportal-20250524134911180600000001"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4" -> (known after apply)
      ~ code_sha256                 = "wrwHITudxuGca9Zp4lRdyTbVT0qsZ6rQejBKXwiOYzo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-27T02:18:04.761+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "bLKYJcDsH5n0yhaP1hTt02IVCebukMZ2On4oZnc0jZZkX0hGPwdVLsCMvqkNYFQmWhrA5YlWAnWK2MvcxHddYQ==" -> "JDdMAc3k50zhjdLt/9I9ib3HNedIn1eqqPo4TZIY+vYqI5rssgHcomFIaKPBzyTcMhGir24t1RnFeLi+ENDckw==" # forces replacement
      ~ source_code_size            = 17951217 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_s3_bucket_versioning.svep-references will be created
  + resource "aws_s3_bucket_versioning" "svep-references" {
      + bucket = "svep-backend-references-20250524134904629800000002"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "8613266638684832230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "255e3d7902500198d6cc85b54b7e48e23eb7230a" -> "db7bdf7abd83380c90ca433b7070fd979ac96b66"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "7652077732027643493" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "255e3d7902500198d6cc85b54b7e48e23eb7230a" -> "db7bdf7abd83380c90ca433b7070fd979ac96b66"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7019568072017726227" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072339508000" -> "1748506386659154800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6738116780104036559" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072028128000" -> "1748506387429275000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4257150166791912404" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071433938000" -> "1748506386649159000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "828897542561661082" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071346587800" -> "1748506387244049000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:22cba93ea3afba0596e2d8d94e4d7824dda3d32f73cbbf3e260bb874d242e817127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:22cba93ea3afba0596e2d8d94e4d7824dda3d32f73cbbf3e260bb874d242e817" -> (known after apply)
        name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "044a5a3432974a6c701cc4a7e96b40e1fd2856c7" -> "a63a48f8929a01b0c224b3c494e83335f0e2e015"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "044a5a3432974a6c701cc4a7e96b40e1fd2856c7" -> "a63a48f8929a01b0c224b3c494e83335f0e2e015"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4333101010993935966" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072230688000" -> "1748506387553427000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2774248776896703958" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071446255000" -> "1748506387759094000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6176529677148620091" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072235490000" -> "1748506386959305000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8436155130282382681" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071484670000" -> "1748506388021951000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1687911474222748592" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072463373000" -> "1748506387966338000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3362060528695299874" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072348376000" -> "1748506387955741800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4803552922323816431" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071863768200" -> "1748506388034980000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "329662599034451975" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072227954000" -> "1748506387735675000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2819069927824818523" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071972900000" -> "1748506387174334000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "793600866843254176" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071452176000" -> "1748506386929215000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2257836864996758556" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071728066000" -> "1748506387147468000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4847347641194015475" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312072375292000" -> "1748506387661699000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "301333099357466849" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071130333000" -> "1748506386732264000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "298668660462482047" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071952931800" -> "1748506387323856200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1514616651873966336" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071870473000" -> "1748506387119207000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2389701127386598120" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071820193000" -> "1748506387834242200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1805263941929168870" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071979314000" -> "1748506386671601000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4108385567130375346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071857618000" -> "1748506387241127000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1126554180938343542" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071425435000" -> "1748506387145022000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4647262764519587137" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071354668000" -> "1748506386469138000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:8fcab84b4f563d2bfa01e6541e05ed104e1ddb2bba643de583bd3109e2d0a79e" -> (known after apply)
      ~ last_modified                  = "2025-05-27T02:19:19.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6149282962149294142" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071233004000" -> "1748506387551034000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4" -> (known after apply)
      ~ code_sha256                 = "oLFCCnga6+hreGfcYHe6e7akaGsozoZY7ucc6mKLyqA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-27T02:18:16.525+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/c67ed160dec2335aa61bcdc6ba070bfee92d27b09bd4a09670b3191288f21ed6.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23517828 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250524134911333700000002/builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "b6ed04166d076b37cf1a0e0b300bae96-5" -> (known after apply)
      ~ id                            = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> (known after apply)
      ~ key                           = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/c67ed160dec2335aa61bcdc6ba070bfee92d27b09bd4a09670b3191288f21ed6.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/c67ed160dec2335aa61bcdc6ba070bfee92d27b09bd4a09670b3191288f21ed6.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/c67ed160dec2335aa61bcdc6ba070bfee92d27b09bd4a09670b3191288f21ed6.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c67ed160dec2335aa61bcdc6ba070bfee92d27b09bd4a09670b3191288f21ed6.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8767329369514517127" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a5fae827ec9576d35fb28d325412a6cc68f76839a5fb40cd7f944c4b01a211e8.zip" -> "builds/c67ed160dec2335aa61bcdc6ba070bfee92d27b09bd4a09670b3191288f21ed6.zip"
          ~ "timestamp" = "1748312081977211000" -> "1748506401448361000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "256880076051797315" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071368683000" -> "1748506386661102000"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3812825530476106348" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312071534106000" -> "1748506387659913000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e" -> (known after apply)
        name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "af01671a5c17b463ed7542098f17e9ba058847c5" -> "42de7c4cad2a2b5830938212ba14059338b36c62"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "af01671a5c17b463ed7542098f17e9ba058847c5" -> "42de7c4cad2a2b5830938212ba14059338b36c62"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:bdd3aec9ef691f50dd33868c209c3a42938da3fc0a18fc3498dbf7de9709773c127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:bdd3aec9ef691f50dd33868c209c3a42938da3fc0a18fc3498dbf7de9709773c" -> (known after apply)
        name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ repo_digest  = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "a875e17d03b7e60525eb88a0e60ed8a2ae7a917e" -> "8668b1da510491513fc8972dbc0533366291a1cc"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "a875e17d03b7e60525eb88a0e60ed8a2ae7a917e" -> "8668b1da510491513fc8972dbc0533366291a1cc"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7550213493183711322" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312082050479000" -> "1748506396437410200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ last_modified                  = "2025-05-27T02:19:10.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:9b28bb94ad42944e6058267fab65615e6e03e8c1e57978275e5a0734e406e9b2" -> (known after apply)
      ~ last_modified                  = "2025-05-27T02:32:20.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:4",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6062177119671984176" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312082370538000" -> "1748506396639213000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3545579109924336800" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748312082471106000" -> "1748506396754542200"
            # (1 unchanged element hidden)
        }
    }

Plan: 46 to add, 37 to change, 43 to destroy.
module.svep[0].aws_s3_bucket_versioning.svep-references: Creating...
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=8613266638684832230]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.webgui.null_resource.s3-upload: Destroying... [id=7652077732027643493]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-updateFiles/package.py" "build" "--timestamp" "1748506387551034000" "builds/c9aeb352ba865d75525b04f41669122fd57b4050d0247ae84632e4cb48ffe7ec.plan.json"]
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-deidentifyFiles/package.py" "build" "--timestamp" "1748506386959305000" "builds/4a5a820f7ea199227e5039a12018bef729e80194bc11a09402dd97a2c12342bb.plan.json"]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/svep.lambda-clearTempAndRegions/package.py" "build" "--timestamp" "1748506396437410200" "builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.plan.json"]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/svep.lambda-updateReferenceFiles/package.py" "build" "--timestamp" "1748506396639213000" "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.plan.json"]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/cognito.lambda-logEmailDelivery/package.py" "build" "--timestamp" "1748506387429275000" "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.plan.json"]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/c9aeb352ba865d75525b04f41669122fd57b4050d0247ae84632e4cb48ffe7ec.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/186/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/c9aeb352ba865d75525b04f41669122fd57b4050d0247ae84632e4cb48ffe7ec.zip
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: creating 'builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.zip' archive
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/186/default/svep/lambda/clearTempAndRegions
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): Created: builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.zip
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 0s [id=5065938611014961206]
module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creation complete after 0s [id=7385197562822511005]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/security.lambda-sendSecurityAlert/package.py" "build" "--timestamp" "1748506387659913000" "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.plan.json"]
module.sbeacon.module.lambda-generateReports.null_resource.archive[0]: Creating...
module.svep[0].module.docker_image_qcFigures_lambda.docker_image
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.